Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 480, 640, 3)  0                                            
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 512, 640, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 640, 64) 1792        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 640, 32) 18464       conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 320, 32) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 320, 64) 18496       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 320, 32) 18464       conv2d_3[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 320, 32) 0           max_pooling2d_1[0][0]            
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 128, 160, 32) 0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 160, 64) 18496       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 160, 32) 18464       conv2d_5[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 128, 160, 32) 0           max_pooling2d_2[0][0]            
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 64, 80, 32)   0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 80, 64)   18496       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 80, 32)   18464       conv2d_7[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 80, 32)   0           max_pooling2d_3[0][0]            
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 32, 40, 32)   0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 40, 64)   18496       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 40, 32)   18464       conv2d_9[0][0]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 40, 32)   0           max_pooling2d_4[0][0]            
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 16, 20, 32)   0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 20, 64)   18496       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 20, 32)   18464       conv2d_11[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 20, 32)   0           max_pooling2d_5[0][0]            
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 8, 10, 32)    0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 8, 10, 64)    18496       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 8, 10, 32)    18464       conv2d_13[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 8, 10, 32)    0           max_pooling2d_6[0][0]            
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 4, 5, 32)     0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 4, 5, 64)     18496       max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 4, 5, 32)     18464       conv2d_15[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 4, 5, 32)     0           max_pooling2d_7[0][0]            
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 8, 10, 32)    0           add_7[0][0]                      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8, 10, 64)    0           max_pooling2d_6[0][0]            
                                                                 up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 8, 10, 64)    36928       concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 8, 10, 32)    18464       conv2d_17[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 10, 32)    0           max_pooling2d_6[0][0]            
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 16, 20, 32)   0           add_8[0][0]                      
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 16, 20, 64)   0           max_pooling2d_5[0][0]            
                                                                 up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 20, 64)   36928       concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 16, 20, 32)   18464       conv2d_19[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 16, 20, 32)   0           max_pooling2d_5[0][0]            
                                                                 conv2d_20[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 32, 40, 32)   0           add_9[0][0]                      
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 32, 40, 64)   0           max_pooling2d_4[0][0]            
                                                                 up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 32, 40, 64)   36928       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 32, 40, 32)   18464       conv2d_21[0][0]                  
__________________________________________________________________________________________________
add_10 (Add)                    (None, 32, 40, 32)   0           max_pooling2d_4[0][0]            
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 64, 80, 32)   0           add_10[0][0]                     
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 64, 80, 64)   0           max_pooling2d_3[0][0]            
                                                                 up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 64, 80, 64)   36928       concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 64, 80, 32)   18464       conv2d_23[0][0]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 80, 32)   0           max_pooling2d_3[0][0]            
                                                                 conv2d_24[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 128, 160, 32) 0           add_11[0][0]                     
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 128, 160, 64) 0           max_pooling2d_2[0][0]            
                                                                 up_sampling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 128, 160, 64) 36928       concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 128, 160, 32) 18464       conv2d_25[0][0]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 128, 160, 32) 0           max_pooling2d_2[0][0]            
                                                                 conv2d_26[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 256, 320, 32) 0           add_12[0][0]                     
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 256, 320, 64) 0           max_pooling2d_1[0][0]            
                                                                 up_sampling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 256, 320, 64) 36928       concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 256, 320, 32) 18464       conv2d_27[0][0]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 256, 320, 32) 0           max_pooling2d_1[0][0]            
                                                                 conv2d_28[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, 512, 640, 32) 0           add_13[0][0]                     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 512, 640, 5)  165         up_sampling2d_7[0][0]            
__________________________________________________________________________________________________
cropping2d_1 (Cropping2D)       (None, 480, 640, 5)  0           conv2d_29[0][0]                  
==================================================================================================
Total params: 611,493
Trainable params: 611,493
Non-trainable params: 0
__________________________________________________________________________________________________
